In [579]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [580]:
df = pd.read_csv('train.csv')
df1 = pd.read_csv('test.csv')

In [581]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [582]:
df1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [583]:
dfy = df.Survived

df.drop(['PassengerId','Survived','Name','Ticket','Cabin'],axis=1,inplace=True)
df1.drop(['PassengerId','Name','Ticket','Cabin'],axis=1,inplace=True)

In [584]:
df.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [585]:
df1.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [586]:
print('shape of training set : ',df.shape)
print('shape of testing set : ',df1.shape)

shape of training set :  (891, 7)
shape of testing set :  (418, 7)

In [587]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  889 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 48.9+ KB

In [588]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      417 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

In [589]:
df.describe()

           Pclass         Age       SibSp       Parch        Fare
count  891.000000  714.000000  891.000000  891.000000  891.000000
mean     2.308642   29.699118    0.523008    0.381594   32.204208
std      0.836071   14.526497    1.102743    0.806057   49.693429
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   20.125000    0.000000    0.000000    7.910400
50%      3.000000   28.000000    0.000000    0.000000   14.454200
75%      3.000000   38.000000    1.000000    0.000000   31.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200

In [590]:
df1.describe()

           Pclass         Age       SibSp       Parch        Fare
count  418.000000  332.000000  418.000000  418.000000  417.000000
mean     2.265550   30.272590    0.447368    0.392344   35.627188
std      0.841838   14.181209    0.896760    0.981429   55.907576
min      1.000000    0.170000    0.000000    0.000000    0.000000
25%      1.000000   21.000000    0.000000    0.000000    7.895800
50%      3.000000   27.000000    0.000000    0.000000   14.454200
75%      3.000000   39.000000    1.000000    0.000000   31.500000
max      3.000000   76.000000    8.000000    9.000000  512.329200

In [591]:
column_df = df.columns

for x in column_df:
    print('unique value information : ',x)
    # print(df[x].unique())
    print('number of unique value : ',df[x].unique().shape[0])
    print('number of null (True if value is NaN) : \n',df[x].isnull().value_counts())
    print('\n','-------------------------------------------------------------------------------','\n')

unique value information :  Pclass
number of unique value :  3
number of null (True if value is NaN) :
 False    891
Name: Pclass, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Sex
number of unique value :  2
number of null (True if value is NaN) :
 False    891
Name: Sex, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Age
number of unique value :  89
number of null (True if value is NaN) :
 False    714
True     177
Name: Age, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  SibSp
number of unique value :  7
number of null (True if value is NaN) :
 False    891
Name: SibSp, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Parch
number of unique value :  7
number of null (True if value is NaN) :
 False    891
Name: Parch, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Fare
number of unique value :  248
number of null (True if value is NaN) :
 False    891
Name: Fare, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Embarked
number of unique value :  4
number of null (True if value is NaN) :
 False    889
True       2
Name: Embarked, dtype: int64

 -------------------------------------------------------------------------------

In [592]:
column_df1 = df1.columns

for x in column_df1:
    print('unique value information : ',x)
    # print(df1[x].unique())
    print('number of unique value : ',df1[x].unique().shape[0])
    print('number of null (True if value is NaN) : \n',df1[x].isnull().value_counts())
    print('\n','-------------------------------------------------------------------------------','\n')

unique value information :  Pclass
number of unique value :  3
number of null (True if value is NaN) :
 False    418
Name: Pclass, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Sex
number of unique value :  2
number of null (True if value is NaN) :
 False    418
Name: Sex, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Age
number of unique value :  80
number of null (True if value is NaN) :
 False    332
True      86
Name: Age, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  SibSp
number of unique value :  7
number of null (True if value is NaN) :
 False    418
Name: SibSp, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Parch
number of unique value :  8
number of null (True if value is NaN) :
 False    418
Name: Parch, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Fare
number of unique value :  170
number of null (True if value is NaN) :
 False    417
True       1
Name: Fare, dtype: int64

 -------------------------------------------------------------------------------

unique value information :  Embarked
number of unique value :  3
number of null (True if value is NaN) :
 False    418
Name: Embarked, dtype: int64

 -------------------------------------------------------------------------------

#  




### Replace NaN value with mean value

#### Age in df and df1

In [593]:
df.Age.isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [594]:
df.Age.fillna(df.Age.mean(),inplace=True)

In [595]:
df.Age.isnull().value_counts()

False    891
Name: Age, dtype: int64

In [596]:
df1.Age.isnull().value_counts()

False    332
True      86
Name: Age, dtype: int64

In [597]:
df1.Age.fillna(df1.Age.mean(),inplace=True)

In [598]:
df1.Age.isnull().value_counts()

False    418
Name: Age, dtype: int64

#### Embarked in df has 2 missing valued , replace it by mode of that column

In [599]:
df.Embarked.isnull().value_counts()

False    889
True       2
Name: Embarked, dtype: int64

In [600]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [601]:
df.Embarked.fillna('S',inplace=True)

In [602]:
df.Embarked.isnull().value_counts()

False    891
Name: Embarked, dtype: int64

#### Fare in df1 has 1 missing valued , replace it by mean of that column

In [603]:
df1.Fare.isnull().value_counts()

False    417
True       1
Name: Fare, dtype: int64

In [604]:
df1.Fare.fillna(df1.Fare.mean(),inplace=True)

In [605]:
df1.Fare.isnull().value_counts()

False    418
Name: Fare, dtype: int64

In [606]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       891 non-null    float64
 3   SibSp     891 non-null    int64
 4   Parch     891 non-null    int64
 5   Fare      891 non-null    float64
 6   Embarked  891 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 48.9+ KB

In [607]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    418 non-null    int64
 1   Sex       418 non-null    object
 2   Age       418 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
 5   Fare      418 non-null    float64
 6   Embarked  418 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 23.0+ KB

####  missing value problem solved!!

### labeling of column which contain catagorical data in object data type ('Sex' and 'Embarked')

In [608]:
from sklearn.preprocessing import LabelEncoder

In [609]:
le = LabelEncoder()

le.fit(df.Sex)
Sex_labeled = le.transform(df.Sex)
df['Sex_labeled'] = Sex_labeled
df.drop(['Sex'],axis=1,inplace=True)

le.fit(df1.Sex)
Sex_labeled = le.transform(df1.Sex)
df1['Sex_labeled'] = Sex_labeled
df1.drop(['Sex'],axis=1,inplace=True)

le.fit(df.Embarked)
Embarked_labeled = le.transform(df.Embarked)
df['Embarked_labeled'] = Embarked_labeled
df.drop(['Embarked'],axis=1,inplace=True)

le.fit(df1.Embarked)
Embarked_labeled = le.transform(df1.Embarked)
df1['Embarked_labeled'] = Embarked_labeled
df1.drop(['Embarked'],axis=1,inplace=True)

In [610]:
df.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_labeled  Embarked_labeled
0       3  22.0      1      0   7.2500            1                 2
1       1  38.0      1      0  71.2833            0                 0
2       3  26.0      0      0   7.9250            0                 2
3       1  35.0      1      0  53.1000            0                 2
4       3  35.0      0      0   8.0500            1                 2

In [611]:
df1.head()

   Pclass   Age  SibSp  Parch     Fare  Sex_labeled  Embarked_labeled
0       3  34.5      0      0   7.8292            1                 1
1       3  47.0      1      0   7.0000            0                 2
2       2  62.0      0      0   9.6875            1                 1
3       3  27.0      0      0   8.6625            1                 2
4       3  22.0      1      1  12.2875            0                 2

In [612]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Pclass            891 non-null    int64
 1   Age               891 non-null    float64
 2   SibSp             891 non-null    int64
 3   Parch             891 non-null    int64
 4   Fare              891 non-null    float64
 5   Sex_labeled       891 non-null    int32
 6   Embarked_labeled  891 non-null    int32
dtypes: float64(2), int32(2), int64(3)
memory usage: 41.9 KB

In [613]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Pclass            418 non-null    int64
 1   Age               418 non-null    float64
 2   SibSp             418 non-null    int64
 3   Parch             418 non-null    int64
 4   Fare              418 non-null    float64
 5   Sex_labeled       418 non-null    int32
 6   Embarked_labeled  418 non-null    int32
dtypes: float64(2), int32(2), int64(3)
memory usage: 19.7 KB

#  



## Train test split of df

In [614]:
from sklearn.model_selection import train_test_split as tts

In [615]:
x_train, x_test, y_train, y_test = tts(df,dfy,test_size = 0.25)

In [616]:
print('shape of train and test set : ')
print('x_train : ',x_train.shape)
print('x_test : ',x_test.shape)
print('y_train : ',y_train.shape)
print('y_test : ',y_test.shape)

shape of train and test set :
x_train :  (668, 7)
x_test :  (223, 7)
y_train :  (668,)
y_test :  (223,)

#  



## Random Forest model

In [617]:
from sklearn.ensemble import RandomForestClassifier as RFC
from sklearn.metrics import roc_auc_score

In [618]:
model_rfc = RFC(max_depth=20,n_estimators=100,random_state=42)
model_rfc.fit(df,dfy)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=20, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=42, verbose=0,
                       warm_start=False)

In [619]:
model_rfc.score(df,dfy)

0.9820426487093153

In [621]:
y_pred = model_rfc.predict(df1)

#roc_auc_score(y_test,y_pred)

#   



## SVM classifier

In [655]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

scaler.fit(df)
df = scaler.transform(df)

scaler.fit(x_test)
x_test = scaler.transform(x_test)

scaler.fit(df1)
df1 = scaler.transform(df1)

In [656]:
from sklearn.svm import SVC

In [657]:
model_svm = SVC(C=10)
model_svm.fit(df,dfy)

SVC(C=10, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [658]:
model_svm.score(df,dfy)

0.8597081930415263

In [659]:
y_pred = model_svm.predict(df1)

#roc_auc_score(y_test,y_pred)

#  



## creat submission file

In [660]:
Survived = y_pred

In [661]:
PassengerId = np.arange(892,1310)

In [662]:
ans = pd.DataFrame(list(zip(PassengerId,Survived)),columns=['PassengerId','Survived'])
ans.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [663]:
ans.to_csv('ans.csv',index=False)